# *****************************************************************
# На входе список чисел, требуется вывести - максимальное, минимальное и
# все числа, которые делятся на 3 и не делятся на 5
# *****************************************************************

a = input("Введите целые числа через ' '-пробел, и нажмите Enter: ").split()
print(a)

max = int(a[0])
min = int(a[0])
div = []

for i in range(len(a)):
    if max < int(a[i]):
        max = int(a[i])

for i in range(len(a)):
    if min > int(a[i]):
        min = int(a[i])

for i in range(len(a)):
    if int(a[i]) % 3 == 0:
        if int(a[i]) % 5 != 0:
            div.append(a[i])

print(f"Максимальное число: {max},\n"
      f"Минимальное число: {min},\n"
      f"Числа, которые делятся на 3 но не делятся на 5: {', '.join(div)}.")
